Обработки/Reports/_ОповещениеОДняхРожденияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОповещениеОДняхРожденияСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачианяСТекущейДаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОповещениеОДняхРожденияСотрудников/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Оповещение о днях рождения сотрудников",
		"0.01",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповеститьОДняхРожденияСотрудников", "Оповестить о днях рождения сотрудников", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
#Область НачалоСбораСтатистики
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
#КонецОбласти	
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "ОповеститьОДняхРожденияСотрудников") Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата()) Тогда
		
			Результат		= Новый ТабличныйДокумент;
			ОтправитьОтчет	= Ложь;
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКоманды);
			
			ЗаполнитьОтчет(Результат, ПараметрыКоманды.СписокОрганизаций, ОтправитьОтчет);
			
			Если ОтправитьОтчет Тогда
				
				ПараметрыПисьма = Новый Структура;
				ПараметрыПисьма.Вставить("Кому", 		ПараметрыКоманды.ПолучателиОтчета);
				ПараметрыПисьма.Вставить("Тема", 		"Ближайшие дни рождения сотрудников");
				ПараметрыПисьма.Вставить("Тело", 		РаботаСОтчетами.ТабличныйДокументВHTML(Результат));
				ПараметрыПисьма.Вставить("ТипТекста", 	ТипТекстаПочтовогоСообщения.HTML);
				
				РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма,, Истина);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

КонецПроцедуры

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
#Область НачалоСбораСтатистики
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
#КонецОбласти	
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьОтчет(ДокументРезультат, ЭтотОбъект.Организация);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

КонецПроцедуры

Процедура ЗаполнитьОтчет(ДокументРезультат, СписокОрганизаций, ЕстьДанные = Ложь)
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", 		 НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СписокОрганизаций", 	 СписокОрганизаций);
	Запрос.УстановитьПараметр("КоличествоДней", 	 ЭтотОбъект.КоличествоДней);
	Запрос.УстановитьПараметр("НачианяСТекущейДаты", ЭтотОбъект.НачианяСТекущейДаты);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 100
		|	ДанныеКалендаря.Дата КАК Дата,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерДня
		|ПОМЕСТИТЬ _РабочиеДни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата >= &ТекущаяДата
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &НачианяСТекущейДаты
		|			ТОГДА &ТекущаяДата
		|		КОГДА &КоличествоДней = 0
		|			ТОГДА _РабочиеДни2.Дата
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(_РабочиеДни1.Дата, ДЕНЬ, 1)
		|	КОНЕЦ КАК ДатаНачала,
		|	_РабочиеДни2.Дата КАК ДатаОкончания
		|ПОМЕСТИТЬ _Отбор
		|ИЗ
		|	_РабочиеДни КАК _РабочиеДни0
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РабочиеДни КАК _РабочиеДни1
		|		ПО (_РабочиеДни1.НомерДня = &КоличествоДней)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РабочиеДни КАК _РабочиеДни2
		|		ПО (_РабочиеДни2.НомерДня = &КоличествоДней + 1)
		|ГДЕ
		|	_РабочиеДни0.НомерДня = 1
		|	И _РабочиеДни0.Дата = &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Имя + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК ФИО,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	ДЕНЬГОДА(РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения) КАК ДеньГода
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&ТекущаяДата, Организация В (&СписокОрганизаций)) КАК СотрудникиОрганизацииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(&ТекущаяДата, Организация В (&СписокОрганизаций)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО СотрудникиОрганизацииСрезПоследних.Организация = РеквизитыСотрудниковОрганизацииСрезПоследних.Организация
		|			И СотрудникиОрганизацииСрезПоследних.Сотрудник.ЮрФизЛицо = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Отбор КАК _Отбор
		|		ПО (ДОБАВИТЬКДАТЕ(РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения, ГОД, РАЗНОСТЬДАТ(РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения, _Отбор.ДатаОкончания, ГОД)) МЕЖДУ _Отбор.ДатаНачала И _Отбор.ДатаОкончания)
		|ГДЕ
		|	СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДеньГода,
		|	ФИО";
	
	Результат = Запрос.Выполнить();
	
	ЕстьДанные = НЕ Результат.Пустой();
	
	Макет = ПолучитьМакет("Отчет");
	
	ОбластьШапка	=  Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	=  Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.ФИО			 = Выборка.ФИО;
		ОбластьСтрока.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения, "ДФ='dd MMMM'");
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры
